{
   "BookRecommendation":[
      {
         "BookTitle":"Attack on Titan, Vol. 1",
         "Author":"Hajime Isayama",
         "Tags":"Manga, Horror, Science Fiction",
         "Format":"Paperbag",
	 "Price":"$10.99",
         "Pages":"208",
         "ISBN13":"978-1612620244",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/attackOnTitan.jpg",
         "BookId":1,
         "BookStore":"https://www.barnesandnoble.com/w/attack-on-titan-volume-1-hajime-isayama/1130433132?ean=9781612620244",
         "BookSummary":"In this post-apocalytpic sci-fi story, humanity has been devastated by the bizarre, giant humanoids known as the Titans. Little is known about where they came from or why they are bent on consuming mankind. Seemingly unintelligent, they have roamed the world for years, killing everyone they see. \n For the past century, what's left of man has hidden in a giant, three-walled city. People believe their 50-meter-high walls will protect them from the Titans, but the sudden appearance of an immense Titan is about to change everything."
      },
	  {
         "BookTitle":"Solo Leveling, Vol. 1",
         "Author":"DUBU(REDICE STUDIO)",
         "Tags":"Manga, Fantasy, Action",
         "Format":"Paperbag",
	 "Price":"$20.00",
         "Pages":"320",
         "ISBN13":"978-1975319434",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/soloLeveling.jpg",
         "BookId":2,
         "BookStore":"https://www.barnesandnoble.com/w/solo-leveling-vol-1-dubu-redice-studio/1137838733?ean=9781975319434",
         "BookSummary":"Known as the the Weakest Hunter of All Mankind, E-rank hunter Jinwoo Sung’s contribution to raids amounts to trying not to get killed. \n Unfortunately, between his mother’s hospital bills, his sister’s tuition, and his own lack of job prospects, he has no choice but to continue to put his life on the line. So when an opportunity arises for a bigger payout, he takes it…only to come face-to-face with a being whose power outranks anything he’s ever seen! With the party leader missing an arm and the only healer a quivering mess, can Jinwoo somehow find them a way out?"
      },
	  {
         "BookTitle":"Kimetsu no Yaiba, Vol. 1",
         "Author":"Koyoharu Gotouge",
         "Tags":"Manga, Fantasy, Adventure",
         "Format":"Paperbag",
	 "Price":"$9.99",
         "Pages":"192",
         "ISBN13":"978-1974700523",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/kimetsuNoYaiba.jpg",
         "BookId":3,
         "BookStore":"https://www.barnesandnoble.com/w/demon-slayer-koyoharu-gotouge/1127396426?ean=9781974700523",
         "BookSummary":"Tanjiro sets out on the path of the Demon Slayer to save his sister and avenge his family! \n In Taisho-era Japan, kindhearted Tanjiro Kamado makes a living selling charcoal. But his peaceful life is shattered when a demon slaughters his entire family. His little sister Nezuko is the only survivor, but she has been transformed into a demon herself! Tanjiro sets out on a dangerous journey to find a way to return his sister to normal and destroy the demon who ruined his life. \n Learning to destroy demons won’t be easy, and Tanjiro barely knows where to start. The surprise appearance of another boy named Giyu, who seems to know what’s going on, might provide some answers—but only if Tanjiro can stop Giyu from killing his sister first!"
      },
	  {
         "BookTitle":"Spy x Family, Vol. 1",
         "Author":"Tatsuya Endo",
         "Tags":"Manga, Humor, Action",
         "Format":"Paperbag",
         "Price":"$9.99",
         "Pages":"220",
         "ISBN13":"978-1974715466",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/spyXFamily.jpg",
         "BookId":4,
         "BookStore":"https://www.barnesandnoble.com/w/spy-x-family-vol-1-tatsuya-endo/1134080783?ean=9781974715466",
         "BookSummary":"An action-packed comedy about a fake family that includes a spy, an assassin and a telepath! \n Master spy Twilight is unparalleled when it comes to going undercover on dangerous missions for the betterment of the world. But when he receives the ultimate assignment—to get married and have a kid—he may finally be in over his head! \n Not one to depend on others, Twilight has his work cut out for him procuring both a wife and a child for his mission to infiltrate an elite private school. What he doesn’t know is that the wife he’s chosen is an assassin and the child he’s adopted is a telepath!"
      },
	  {
         "BookTitle":"The Way of the Househusband, Vol. 1",
         "Author":"Kousuke Oono",
         "Tags":"Manga, Contemporary, Action",
         "Format":"Paperbag",
         "Price":"$12.99",
         "Pages":"160",
         "ISBN13":"978-1974709403",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/theWayOfTheHousehusband.jpg",
         "BookId":5,
         "BookStore":"https://www.barnesandnoble.com/w/the-way-of-the-househusband-vol-1-kousuke-oono/1130590331?ean=9781974709403",
         "BookSummary":"It’s a day in the life of your average househusband—if your average househusband is the legendary yakuza “the Immortal Dragon”! \n A former yakuza legend leaves it all behind to become your everyday househusband. But it’s not easy to walk away from the gangster life, and what should be mundane household tasks are anything but! \n He was the fiercest member of the yakuza, a man who left countless underworld legends in his wake. They called him “the Immortal Dragon.” But one day he walked away from it all to travel another path—the path of the househusband! The curtain rises on this cozy yakuza comedy!"
      },
	  {
         "BookTitle":"Jujutsu Kaisen, Vol. 1",
         "Author":"Gege Akutami",
         "Tags":"Manga, Horror, Fantasy",
         "Format":"Paperbag",
	 "Price":"$9.99",
         "Pages":"192",
         "ISBN13":"978-1974710027",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/jujutsuKaisen.jpeg",
         "BookId":6,
         "BookStore":"https://www.barnesandnoble.com/w/jujutsu-kaisen-vol-1-gege-akutami/1130959945?ean=9781974710027",
         "BookSummary":"Yuji Itadori is resolved to save the world from cursed spirits, but he soon learns that the best way to do it is to slowly lose his humanity and become one himself! \n In a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna were lost and scattered about. Should any demon consume Sukuna’s body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of Jujutsu Sorcerers who exist to protect the precarious existence of the living from the supernatural! \n Although Yuji Itadori looks like your average teenager, his immense physical strength is something to behold! Every sports club wants him to join, but Itadori would rather hang out with the school outcasts in the Occult Research Club. One day, the club manages to get their hands on a sealed cursed object. Little do they know the terror they’ll unleash when they break the seal"
      },
	  {
         "BookTitle":"Clap When You Land",
         "Author":"Elizabeth Acevedo",
         "Tags":"Young Adult, Contemporary, LGBT",
         "Format":"Hardcover",
	 "Price":"$18.99",
         "Pages":"432",
         "ISBN13":"978-0062882769",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/clapWhenYouLand.jpg",
         "BookId":7,
         "BookStore":"https://www.barnesandnoble.com/w/clap-when-you-land-elizabeth-acevedo/1131302260?ean=9780062882769",
         "BookSummary":"Camino Rios lives for the summers when her father visits her in the Dominican Republic. But this time, on the day when his plane is supposed to land, Camino arrives at the airport to see crowds of crying people. \n In New York City, Yahaira Rios is called to the principal’s office, where her mother is waiting to tell her that her father, her hero, has died in a plane crash. \n Separated by distance—and Papi’s secrets—the two girls are forced to face a new reality in which their father is dead and their lives are forever altered. \n And then, when it seems like they’ve lost everything of their father, they learn of each other. "
      },
	  {
         "BookTitle":"Six of Crows, #1",
         "Author":"Leigh Bardugo",
         "Tags":"Young Adult, Fantasy, Adventure",
         "Format":"Paperbag",
	 "Price":"$11.99",
         "Pages":"496",
         "ISBN13":"978-1250076960",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/sixOfCrows.jpeg",
         "BookId":8,
         "BookStore":"https://www.barnesandnoble.com/w/six-of-crows-leigh-bardugo/1120964159?ean=9781250076960",
         "BookSummary":"Ketterdam: a bustling hub of international trade where anything can be had for the right price—and no one knows that better than criminal prodigy Kaz Brekker. Kaz is offered a chance at a deadly heist that could make him rich beyond his wildest dreams. But he can't pull it off alone. \n <em>A convict with a thirst for revenge.</em> \n <em>A sharpshooter who can't walk away from a wager.</em> \n <em>A runaway with a privileged past.</em> \n <em>A spy known as the Wraith.</em> \n  <em>A Heartrender using her magic to survive the slums.</em> \n <em>A thief with a gift for unlikely escapes.</em> \n Six dangerous outcasts. One impossible heist. Kaz's crew is the only thing that might stand between the world and destruction—if they don't kill each other first."
      },
	  {
         "BookTitle":"The Inheritance Games, #1",
         "Author":"Jennifer Lynn Barnes",
         "Tags":"Young Adult, Mystery, Romance",
         "Format":"Paperbag",
	 "Price":"$10.99",
         "Pages":"400",
         "ISBN13":"978-0759555402",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/theInheritanceGames.jpg",
         "BookId":9,
         "BookStore":"https://www.barnesandnoble.com/w/the-inheritance-games-jennifer-lynn-barnes/1136584326?ean=9780759555402",
         "BookSummary":"Avery Grambs has a plan for a better future: survive high school, win a scholarship, and get out. But her fortunes change in an instant when billionaire Tobias Hawthorne dies and leaves Avery virtually his entire fortune. The catch? Avery has no idea why — or even who Tobias Hawthorne is. \n To receive her inheritance, Avery must move into sprawling, secret passage-filled Hawthorne House, where every room bears the old man's touch — and his love of puzzles, riddles, and codes. Unfortunately for Avery, Hawthorne House is also occupied by the family that Tobias Hawthorne just dispossessed. This includes the four Hawthorne grandsons: dangerous, magnetic, brilliant boys who grew up with every expectation that one day, they would inherit billions. Heir apparent Grayson Hawthorne is convinced that Avery must be a conwoman, and he's determined to take her down. His brother, Jameson, views her as their grandfather's last hurrah: a twisted riddle, a puzzle to be solved. Caught in a world of wealth and privilege, with danger around every turn, Avery will have to play the game herself just to survive."
      },
	  {
         "BookTitle":"The Gilded Wolves, #1",
         "Author":"Roshani Chokshi",
         "Tags":"Young Adult, Historical, Fantasy",
         "Format":"Paperbag",
	 "Price":"$10.99",
         "Pages":"416",
         "ISBN13":"978-1250144553",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/theGildedWolves.jpg",
         "BookId":10,
         "BookStore":"https://www.barnesandnoble.com/w/the-gilded-wolves-roshani-chokshi/1128526444?ean=9781250144553",
         "BookSummary":"<em>No one believes in them. But soon no one will forget them.</em> \n It's 1889. The city is on the cusp of industry and power, and the Exposition Universelle has breathed new life into the streets and dredged up ancient secrets. Here, no one keeps tabs on dark truths better than treasure-hunter and wealthy hotelier Séverin Montagnet-Alarie. When the elite, ever powerful Order of Babel coerces him to help them on a mission, Séverin is offered a treasure that he never imagined: his true inheritance. \n To hunt down the ancient artifact the Order seeks, Séverin calls upon a band of unlikely experts: An engineer with a debt to pay. A historian banished from his home. A dancer with a sinister past. And a brother in arms if not blood. \n Together, they will join Séverin as he explores the dark, glittering heart of Paris. What they find might change the course of history—but only if they can stay alive."
      },
	  {
         "BookTitle":"A Good Girl's Guide to Murder",
         "Author":"Holly Jackson",
         "Tags":"Young Adult, Mystery, Thriller",
         "Format":"Paperbag",
	 "Price":"$10.99",
         "Pages":"433",
         "ISBN13":"978-1984896391",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/aGoodGirl'sGuidetoMurder.jpg",
         "BookId":11,
         "BookStore":"https://www.barnesandnoble.com/w/a-good-girls-guide-to-murder-holly-jackson/1132077937?ean=9781984896391",
         "BookSummary":"Everyone in Fairview knows the story. \n Pretty and popular high school senior Andie Bell was murdered by her boyfriend, Sal Singh, who then killed himself. It was all anyone could talk about. And five years later, Pip sees how the tragedy still haunts her town. \n But she can't shake the feeling that there was more to what happened that day. She knew Sal when she was a child, and he was always so kind to her. \n How could he possibly have been a killer? \n Now a senior herself, Pip decides to reexamine the closed case for her final project, at first just to cast doubt on the original investigation. But soon she discovers a trail of dark secrets that might actually prove Sal innocent . . . and the line between past and present begins to blur. Someone in Fairview doesn't want Pip digging around for answers, and now her own life might be in danger."
      },
	  {
         "BookTitle":"They Both Die at the End",
         "Author":"Adam Silvera",
         "Tags":"Young Adult, Contemporary, LGBT",
         "Format":"Paperbag",
	 "Price":"$12.99",
         "Pages":"416",
         "ISBN13":"978-0062457806",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/theyBothDieAtTheEnd.jpg",
         "BookId":12,
         "BookStore":"https://www.barnesandnoble.com/w/they-both-die-at-the-end-adam-silvera/1125317666?ean=9780062457806",
         "BookSummary":"On September 5, a little after midnight, Death-Cast calls Mateo Torrez and Rufus Emeterio to give them some bad news: They’re going to die today. \n Mateo and Rufus are total strangers, but, for different reasons, they’re both looking to make a new friend on their End Day. The good news: There’s an app for that. It’s called the Last Friend, and through it, Rufus and Mateo are about to meet up for one last great adventure—to live a lifetime in a single day."
      },
	  {
         "BookTitle":"We Hunt the Flame",
         "Author":"Hafsah Faizal",
         "Tags":"Young Adult, High Fantasy, Science Fiction",
         "Format":"Paperbag",
	 "Price":"$10.99",
         "Pages":"480",
         "ISBN13":"978-1250250797",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/weHuntTheFlame.jpeg",
         "BookId":13,
         "BookStore":"https://www.barnesandnoble.com/w/we-hunt-the-flame-hafsah-faizal/1129098286?ean=9781250250797",
         "BookSummary":"People lived because she killed. People died because he lived. \n Zafira is the Hunter, disguising herself as a man when she braves the cursed forest of the Arz to feed her people. Nasir is the Prince of Death, assassinating those foolish enough to defy his autocratic father, the sultan. If Zafira was exposed as a girl, all of her achievements would be rejected; if Nasir displayed his compassion, his father would punish him in the most brutal of ways. Both Zafira and Nasir are legends in the kingdom of Arawiya—but neither wants to be. \n War is brewing, and the Arz sweeps closer with each passing day, engulfing the land in shadow. When Zafira embarks on a quest to uncover a lost artifact that can restore magic to her suffering world and stop the Arz, Nasir is sent by the sultan on a similar mission: retrieve the artifact and kill the Hunter. But an ancient evil stirs as their journey unfolds—and the prize they seek may pose a threat greater than either can imagine."
      },
	  {
         "BookTitle":"To Sleep in a Sea of Stars",
         "Author":"Christopher Paolini",
         "Tags":"Young Adult, Space, Science Fiction",
         "Format":"Paperbag",
	 "Price":"$21.99",
         "Pages":"880",
         "ISBN13":"978-1250762924",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/toSleepInASeaOfStars.jpg",
         "BookId":14,
         "BookStore":"https://www.barnesandnoble.com/w/to-sleep-in-a-sea-of-stars-christopher-paolini/1134933976?ean=9781250762924",
         "BookSummary":"Kira Navárez dreamed of life on new worlds. \n Now she's awakened a nightmare. \n During a routine survey mission on an uncolonized planet, Kira finds an alien relic. At first she's delighted, but elation turns to terror when the ancient dust around her begins to <em>move</em>. As war erupts among the stars, Kira is launched into a galaxy-spanning odyssey of discovery and transformation. First contact isn't at all what she imagined, and events push her to the very limits of what it means to be human. \n While Kira faces her own horrors, Earth and its colonies stand upon the brink of annihilation. Now, Kira might be humanity's greatest and final hope."
      },
	  {
         "BookTitle":"The Lost Apothecary",
         "Author":"Sarah Penner",
         "Tags":"Adult, Thriller, Contemporary",
         "Format":"Paperbag",
		 "Price":"$17.99",
         "Pages":"352",
         "ISBN13":"978-0778311973",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/theLostApothecary.jpg",
         "BookId":15,
         "BookStore":"https://www.barnesandnoble.com/w/the-lost-apothecary-sarah-penner/1136901699?ean=9780778311973",
         "BookSummary":"Hidden in the depths of eighteenth-century London, a secret apothecary shop caters to an unusual kind of clientele. Women across the city whisper of a mysterious figure named Nella who sells well-disguised poisons to use against the oppressive men in their lives. But the apothecary’s fate is jeopardized when her newest patron, a precocious twelve-year-old, makes a fatal mistake, sparking a string of consequences that echo through the centuries. \n Meanwhile in present-day London, aspiring historian Caroline Parcewell spends her tenth wedding anniversary alone, running from her own demons. When she stumbles upon a clue to the unsolved apothecary murders that haunted London two hundred years ago, her life collides with the apothecary’s in a stunning twist of fate—and not everyone will survive."
      },
	  {
         "BookTitle":"The Midnight Library",
         "Author":"Matt Haig",
         "Tags":"Adult, Fantasy, Science Fiction",
         "Format":"Hardcover",
	 "Price":"$26.00",
         "Pages":"304",
         "ISBN13":"978-0525559474",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/theMidnightLibrary.jpeg",
         "BookId":16,
         "BookStore":"https://www.barnesandnoble.com/w/the-midnight-library-matt-haig/1136586832;jsessionid=AAEDA170FBAB13C0D04181278B7E1A58.prodny_store01-atgap15?ean=9780525559474",
         "BookSummary":"Somewhere out beyond the edge of the universe there is a library that contains an infinite number of books, each one the story of another reality. One tells the story of your life as it is, along with another book for the other life you could have lived if you had made a different choice at any point in your life. While we all wonder how our lives might have been, what if you had the chance to go to the library and see for yourself? Would any of these other lives truly be better? \n In The Midnight Library, Matt Haig's enchanting new novel, Nora Seed finds herself faced with this decision. Faced with the possibility of changing her life for a new one, following a different career, undoing old breakups, realizing her dreams of becoming a glaciologist; she must search within herself as she travels through the Midnight Library to decide what is truly fulfilling in life, and what makes it worth living in the first place."
      },
	  {
         "BookTitle":"The Seven Husbands of Evelyn Hugo",
         "Author":"Taylor Jenkins Reid",
         "Tags":"Adult, LGBT, Historical",
         "Format":"Paperbag",
	 "Price":"$17.00",
         "Pages":"400",
         "ISBN13":"978-1501161933",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/theSevenHusbandsOfEvelynHugo.jpeg",
         "BookId":17,
         "BookStore":"https://www.barnesandnoble.com/w/the-seven-husbands-of-evelyn-hugo-taylor-jenkins-reid/1124863869?ean=9781501161933",
         "BookSummary":"Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now? \n Monique is not exactly on top of the world. Her husband has left her, and her professional life is going nowhere. Regardless of why Evelyn has selected her to write her biography, Monique is determined to use this opportunity to jumpstart her career. \n Summoned to Evelyn’s luxurious apartment, Monique listens in fascination as the actress tells her story. From making her way to Los Angeles in the 1950s to her decision to leave show business in the ‘80s, and, of course, the seven husbands along the way, Evelyn unspools a tale of ruthless ambition, unexpected friendship, and a great forbidden love. Monique begins to feel a very real connection to the legendary star, but as Evelyn’s story near its conclusion, it becomes clear that her life intersects with Monique’s own in tragic and irreversible ways"
      },
	  {
         "BookTitle":"An Ember in the Ashes, #1",
         "Author":"Sabaa Tahir",
         "Tags":"Young Adult, Dystopian, Adventure",
         "Format":"Paperbag",
	 "Price":"$11.99",
         "Pages":"480",
         "ISBN13":"978-1595148049",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/anEmberInTheAshes.jpg",
         "BookId":18,
         "BookStore":"https://www.barnesandnoble.com/w/an-ember-in-the-ashes-sabaa-tahir/1119671406?ean=9781595148049",
         "BookSummary":"Laia is a slave. Elias is a soldier. Neither is free. \n Under the Martial Empire, defiance is met with death. Those who do not vow their blood and bodies to the Emperor risk the execution of their loved ones and the destruction of all they hold dear. It is in this brutal world, inspired by ancient Rome, that Laia lives with her grandparents and older brother. The family ekes out an existence in the Empire’s impoverished backstreets. They do not challenge the Empire. They’ve seen what happens to those who do. But when Laia’s brother is arrested for treason, Laia is forced to make a decision. In exchange for help from rebels who promise to rescue her brother, she will risk her life to spy for them from within the Empire’s greatest military academy. There, Laia meets Elias, the school’s finest soldier—and secretly, its most unwilling. Elias wants only to be free of the tyranny he’s being trained to enforce. He and Laia will soon realize that their destinies are intertwined—and that their choices will change the fate of the Empire itself. "
      },
	  {
         "BookTitle":"The Library of the Dead, #1",
         "Author":"T.L. Huchu",
         "Tags":"Young Adult, Mystery, Horror",
         "Format":"Hardcover",
	 "Price":"$27.99",
         "Pages":"336",
         "ISBN13":"978-1250767769",
         "BookImage":"https://raw.githubusercontent.com/jpoudel99/JSONProjectsIT315/master/theLibraryOfTheDead.jpg",
         "BookId":19,
         "BookStore":"https://www.barnesandnoble.com/w/the-library-of-the-dead-t-l-huchu/1136889568?ean=9781250767769",
         "BookSummary":"WHEN GHOSTS TALK...SHE WILL LISTEN \n Ropa dropped out of school to become a ghostalker – and they sure do love to talk. Now she speaks to Edinburgh’s dead, carrying messages to those they left behind. A girl’s gotta earn a living, and it seems harmless enough. Until, that is, the dead whisper that someone’s bewitching children – leaving them husks, empty of joy and strength. It’s on Ropa’s patch, so she feels honor-bound to investigate. But what she learns will rock her world. \n Ropa will dice with death as she calls on Zimbabwean magic and Scottish pragmatism to hunt down clues. And although underground Edinburgh hides a wealth of dark secrets, she also discovers an occult library, a magical mentor and some unexpected allies. Yet as shadows lengthen, will the hunter become the hunted?"
      }
	   
   ],
   "Status":"OK"
}
